## [terraform-starter](https://jdrodriguezrui.app.spacelift.io/stack/terraform-starter/run/01HXJ3S8E356RDT91XB6SR6MPV) plan logs

<details>
<summary>Click here to expand</summary>

```
[01HXHFTVWFMRBHWMYJQ1V0X37S] Planning changes with 0 custom hooks...
data.spacelift_current_stack.this: Reading...
data.spacelift_current_stack.this: Read complete after 0s [id=terraform-starter]
spacelift_stack.managed: Refreshing state... [id=managed-stack]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_bucket.test will be created
  + resource "google_storage_bucket" "test" {
      + effective_labels            = (known after apply)
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "EUROPE-WEST1"
      + name                        = "julian-spacelift-poc-test"
      + project                     = "development-env-ta"
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "REGIONAL"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

[01HXHFTVWFMRBHWMYJQ1V0X37S] Changes are GO
[01HXHFTVWFMRBHWMYJQ1V0X37S] Uploading the list of managed resources...
[01HXHFTVWFMRBHWMYJQ1V0X37S] Please be aware that the run changes calculation includes output changes.
[01HXHFTVWFMRBHWMYJQ1V0X37S] Resource list upload is GO
[01HXHFTVWFMRBHWMYJQ1V0X37S] Generating JSON representation of the plan...
[01HXHFTVWFMRBHWMYJQ1V0X37S] JSON representation is GO
[01HXHFTVWFMRBHWMYJQ1V0X37S] Loading custom plan policy inputs...
[01HXHFTVWFMRBHWMYJQ1V0X37S] 0 custom plan policy inputs found
[01HXHFTVWFMRBHWMYJQ1V0X37S] No plan policies to evaluate
```

</details>